In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic = pd.read_csv('../datasets/titanic.csv')

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
plus = lambda x, y : x+y
plus(10,25)

35

In [5]:
def fare_to_int(fare):
    to_int = int(fare + fare / 1000)
    return to_int

titanic['Fare'].map(fare_to_int).head()

0     7
1    71
2     7
3    53
4     8
Name: Fare, dtype: int64

In [30]:
titanic['Fare_int'] = titanic['Fare'].map(lambda x: int(x + x / 1000))

In [20]:
titanic[['Fare', 'Fare_int']].head()

      Fare  Fare_int
0   7.2500         7
1  71.2833        71
2   7.9250         7
3  53.1000        53
4   8.0500         8

In [19]:
titanic['Fare_int'] = titanic['Fare'].apply(lambda x: int(x + x / 1000))

In [8]:
titanic['Age'].apply(lambda x: 'Adult' if x >= 18 else 'Child')

0      Adult
1      Adult
2      Adult
3      Adult
4      Adult
       ...
886    Adult
887    Adult
888    Child
889    Adult
890    Adult
Name: Age, Length: 891, dtype: object

In [22]:
titanic['Age'].map(lambda x: 'Adult' if x >= 18 else 'Child')

0      Adult
1      Adult
2      Adult
3      Adult
4      Adult
       ...
886    Adult
887    Adult
888    Child
889    Adult
890    Adult
Name: Age, Length: 891, dtype: object

In [21]:
titanic[['SibSp', 'Parch']].apply(lambda x: x['SibSp'] + x['Parch'], axis=1)

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Length: 891, dtype: int64

In [24]:
titanic[['SibSp', 'Parch']].apply(lambda x: x.sum(), axis=1)

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Length: 891, dtype: int64

In [25]:
import seaborn as sns
iris = sns.load_dataset('iris')

In [26]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [29]:
iris_no_scepices = iris[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']]

In [30]:
iris_no_scepices.applymap(lambda x: x*10).head()

   sepal_length  sepal_width  petal_length  petal_width
0          51.0         35.0          14.0          2.0
1          49.0         30.0          14.0          2.0
2          47.0         32.0          13.0          2.0
3          46.0         31.0          15.0          2.0
4          50.0         36.0          14.0          2.0

In [40]:
col_name = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width']

In [45]:
iris['interaction'] = iris_no_scepices.apply(
    lambda x : x[col_name[0]] * x[col_name[1]] *\ x[col_name[2]] * x[col_name[3]], axis = 1
)

In [46]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species  interaction
0           5.1          3.5           1.4          0.2  setosa       4.9980
1           4.9          3.0           1.4          0.2  setosa       4.1160
2           4.7          3.2           1.3          0.2  setosa       3.9104
3           4.6          3.1           1.5          0.2  setosa       4.2780
4           5.0          3.6           1.4          0.2  setosa       5.0400